// #include <clocale>
// #include <iostream>


    // int — целочисленный тип данных.
    // float — тип данных с плавающей запятой.
    // double — тип данных с плавающей запятой двойной точности.
    // char — символьный тип данных.
    // bool — логический тип данных.

// int a; // объявление переменной a целого типа. 
// float b; // объявление переменной b типа данных с плавающей запятой. 
// double c = 14.2; // инициализация переменной типа double. 
// char d = 's'; // инициализация переменной типа char. 
// bool k = true; // инициализация логической переменной k.

// Существует четыре спецификатора типа, уточняющих внутреннее представление и диапазон значений стандартных типов:

//     short (короткий);
//     long (длинный);
//     signed (знаковый);
//     unsigned (беззнаковый).
//     

//     int (целый);
//     char (символьный);
//     wchar_t (расширенный символьный);
//     bool (логический);
//     float (вещественный);
//     double (вещественный с двойной точностью).

// Первые четыре тина называют целочисленными (целыми), последние два — типами с плавающей точкой. Код, который формирует компилятор для обработки целых величин, отличается от кода для величин с плавающей точкой.

// Существует четыре спецификатора типа, уточняющих внутреннее представление и диапазон значений стандартных типов:

//     short (короткий);
//     long (длинный);
//     signed (знаковый);
//     unsigned (беззнаковый).


