#include <iostream>
#include <string>

int main(int argc, char const *argv[])
{
    int a; 
    std::string cd;
    int Age, w, b; //несколько переменной
    Age = 11;
    char M = 'm';
    cd = "qwqsadsadada";
    w = 99;
    b = 111;
    a = 5;
    std::cout << a << std::endl;
    a = 10;
    std::cout << cd << " " << M << " " << Age << std::endl;

// В имени допустимо использование только следующих символов:
// 1. ПРОПИСНЫЕ и строчные буквы латинского алфавита. При этом не зыбывайте о регистрозависимости языка. Например, Age и age - это два разных имени.
// 2. Цифры. Однако, цифра не может быть использована в качестве первого символа. То есть, Name1 допустимо, 1Name - нет.
// 3. Символ подчеркивания _. Дело в том, что вы должны помнить, что пробел, тоже является символом и данный символ недопустим в имени переменной. Его заменит знак подчеркивания, который улучшит выразительность имен. Например, сравните: ageofman и Age_Of_Man.

// При определении имени для переменной запомните следующее:
// 1. Нельзя называть переменную ключевыми словами языка программирования. Ключевое слово - слово, зарезервированное под синтаксис языка программирования (int, float,double и т. п.). В Visual Studio ключевые слова подсвечиваются синим светом, это как минимум приведет к путанице.
// 2. Нежелательно существование двух идентификаторов с одинаковыми именами.
// 3. Нельзя использовать никакие другие символы, кроме допустимых.(см. выше)

    return 0;
}
